using System.Collections.Generic;
using System.Linq;
using UnityEditor;
using UnityEngine;

[CustomEditor(typeof(TileListEntity))]//拡張するクラスを指定
public class DatabaseSetter : Editor
{
    // 表示用とスコア要は分けたほうがいいのかな？（学校/がっこう　のように）
    List<List<string>> wordList = new List<List<string>>()
    {
        // 人
        new List<string>(){        
            "あべ","いのうえ","うぽつ","えさき","おがわ",
            "かせだ","きたじま","くまだ","けんたろう","こいずみ",
            "さとう","じょに","すらいもも","せきぐち","そね",
            "たに","ちょうの","つちや","てづか","とづか",
            "ななまる","にしだ","ぬまた","ねぎし","ののむら",
            "はとやま","ひむら","ふじき","へんみ","ほしの",
            "まえだ","みっちぇる","むろい","めぐれ","ももどり",
            "やだ","ゆかわ","よしだ",
            "らどくりふ","りょうつ","るる","れんほう","ろばーと",
            "わたなべ"
        },
        new List<string>(){"ごりら","さる","どうぶつ","いきもの","しるばーばっく","まうんてんごりら","ひがしごりら","にしごりら",},
        new List<string>(){"びーる","あるこーる","いっきのみ","うちあげ","えんかい","おさけ","かんぱい","じょっき","どりんく","ぼうねんかい","さけ","はっぽうしゅ","ちゅうじょっき"},
        new List<string>(){"だんご","あまいもの","うずらのたまご","おだんご","きなこだんご","くしだんご","さんきょうだい","しらたまだんご","すいーつ","つくね","でざーと","みたらしだんご","やきとり","わがし"},
        new List<string>(){"どーなつ","あなあきどーなつ","いかりんぐ","うまいぼう","おにおんりんぐ","がむてーぷ","たべもの","ちくわ","ばーむくーへん","べーぐる","まる","みすたーどーなつ","りんぐどーなつ","ろーら","わっか"},
        new List<string>(){"ふえ","あるとりこーだ","えんそう","おーけすとら","がっき","くらりねっと","すいそうがく","そぷらのりこーだ","たてぶえ","まーちんぐ","みゅーじっく","もっかんがっき","りこーだ"},
        new List<string>(){"ぱとか","おまわりさん","かあ","きんきゅうしゃりょう","くるま","けいさつ","こうばん","さつ","じゅうさ","たいほ","のりもの","ぴーしい","ぽりす","まっぽ","みにかあ","れんこう"},
        new List<string>(){"ぼうし","あたま","えいこくしんし","おぺらはっと","かぶりもの","きぞく","しるくはっと","せいそう","だんしゃく","てじなし","とっぷはっと","にんげん","のっぺらぼう","はっと","ひと","ふゆうそう","まじしゃん","ものぽりい","ゆうふくそう","れいふく"},
        new List<string>(){"とけい","あなろぐとけい","おやつのじかん","かけどけい","くろっく","ごじ","じゅうくじ","たいまあ","ていじまえ","ゆうがた","そうちょう","めざまし"},
        new List<string>(){"やま","あるぷす","いなか","うらやま","えべれすと","おね","かざん","きりまんじゃろ","くらいみんぐ","けしき","こうざんびょう","さんみゃく","しぜん","すいす","ぜっけい","そうなん","ちょもらんま","とざん","のどか","はいきんぐ","ひまらや","ふじさん","まうんてん","めいほう","ゆきやま","ろっくくらいみんぐ","わんだーふぉーげる"},
        new List<string>(){"らっぱ","えんそう","おーけすとら","がっき","きんかんがっき","こるねっと","すいそうがく","ちゅーば","とらんぺっと","ばんど","ぶらすばんど","ほるん","まーちんぐ","みゅーじっく","ゆーふぉにあむ"},
        new List<string>(){"ぱんつ","しょうぶしたぎ","ふく","ぼくさーぱんつ","とらんくす","せんたくもの"}, //TODO
        new List<string>(){"けーき","あまいもの","いちごのしょーと","おやつ","かし","くりすますけーき","しょーとけーき","すいーつ","せいようがし","たんじょうび","でざーと","なまくりーむけーき","ばーすでーけーき","ふるーつけーき","ようがし"},
        new List<string>(){"でんきゅう","あかり","いんてりあ","えるいーでぃい","かぐ","けいこうとう","こうげん","しょうめい","はくねつとう","ひらめいた","ふぇらめんとでんきゅう","まめでんきゅう","らいと"},
        new List<string>(){"えびふらい,","あげもの","おかず","くるまえび","ころもあげ","しょくじ","たべもの","てんぷら","ふらい","ようしょく","りょうり"},
        new List<string>(){"ふね","うみ","おーしゃん","かいぞく","ぎょせん","くるーざあ","ごうかきゃくせん","しっぷ","せんぱく","そうなん","たび","ちんぼつせん","つり","ていはく","とこう","にゅうこう","のりもの","はとば","ひょうりゅう","ぼーと","まりーな","みっこう","ゆうらんせん","ようしょくじょ","りょこう"},
        new List<string>(){"ぱそこん","あいてぃい","いんたーねっと","うぃんどうず","おたく","かいはつ","きかい","くろものかでん","げーむかいはつ","こんぴゅーた","じょうほうかしゃかい","たんまつ","でんしきき","どすぶいき","ねっとたんまつ","ぴいしい","ぶるーすくりーん","りなっくす","わーぷろ","ゆにてぃい","まっくぶっくぷろ"},
        new List<string>(){"どらむ","えんそう","おんがく","こだいこ","すねあ","そうおん","たいこ","ばんど","ふろあたむ","まーちんぐ","みゅーじっく","りずむたい","ろっく"},
        new List<string>(){"とり","いきもの","うずら","えと","かるがも","ことり","すずめ","せいぶつ","ちょうるい","つぐみ","ばーど","もず","やちょう","わたりどり"},
        new List<string>(){"ゆきだるま","うぃんたあ","きたぐに","ごうせつちたい","さっぽろゆきまつり","すのーまん","せつぞう","そうなん","つんどら","とうき","なんきょく","ふゆ","ほっきょく","まふゆ"},
        new List<string>(){"かめら","いちがんれふ","うつるんです","おもちや","きねんさつえい","こんぱくとかめら","とうえいき","しゃしんさつえい","すちーるかめら","せるふぃい","つかいすてかめら","とうさつ","ふぃるむかめら","れんずつきふぃるむ"},
        new List<string>(){"こーら","あまいのみもの","いんりょう","うまいのみのも","くろいのみもの","じゅーす","せいりょういんりょうすい","そふとどりんく","たんさんいんりょう","てぃい","どくたーぺっぱあ","のみもの,","ぺぷしこーら","ふぁんた"},
        new List<string>(){"こーひい","あめりかんこーひい","いたりあんこーひい","ういんなーこーひい","えすぷれっそ","おちや","かふえ","きっさてん","しょっき","すーぷ","だーじりんてぃい","ちゃい","てぃい","どりっぷこーひい","のみのも","はーぶてぃい","ぶれいくたいむ","ほっとこーひい","まぐかっぷ","みるくてぃい","もーにんぐこーひい","ゆげ","れもんてぃい"},
        new List<string>(){"ほうせき","あかいほうせき","いし","えいえんのかがやき","がーねっと","きちょうひん","くりすたる","こんごうせき","さんすとーん","るびい","じゅえる","すいしょう","たりすまん","てんねんせき","ふぁいあおぱーる","までらしとりん","れっどすぴねる","ひかりもの","ぶりりあんかっと","らううどかっと","おれんじかいやないと"},
        new List<string>(){"えんぴつ","いろえんぴつ","おえかき","かきかたえんぴつ","くろえんぴつ","こうひつ","しゅくだい","すけっち","でっさん","にぃびぃえんぴつ","ばとるえんぴつ","ひっきようぐ","ぶんぼうぐ","ぺんしる","めも","よんびーえんぴつ","らくがき"},
        new List<string>(){"あいす","おかし","がりがりくん","こおりがし","しゃーべっと","そーだあじ","たべもの","ひょうか","ぼうあいす","れいか"},
        new List<string>(){"じゅう","あんさつ","えあがん", "おもちや", "がすがん","きょうき","くうきじゅう","けんじゅう","ころしや","さばいばるげーむ","じゅう","すぱい","たんじゅう","ちゃか","てっぽう","とかれふ","はじき","ぴすとる","ぶき","べれった","まふぃあ","みりたりい","やくざ","わるさあ"},
        new List<string>(){"すいか","うぉーたーめろん","かじつ","くだもの","こだますいか","すいか","せいか","たべもの","でざーと","なつやさい","びーちぼーる","ふるーつ","べじたぶる","やさい"},
        new List<string>(){"とらっく","ゆそう","おおがたしや","かもつしや","くるま","けいとら","じどうしや","たくはいびん","つみに","のりもの","はたらくくるま","ひっこし","みにかあ","ゆそう", "よんりんしや", "りくそう","るーとはいそう"},
        new List<string>(){"いそづり","うみづり","えぎ","おきづり","かわづり","ぎじえさ","けいりゅうつり","さお","つりざお","ふぃっしんぐ","みつりょう","よづり","りょう","るああ","れじゃあ","ろっど"},
        new List<string>(){"ふぉーく", "いんしょく","おしょくじ","かとらりい","きんぞく","ごはん","しょっき","でぃなあ","ないふ","にくさ","ようしょく","らんち","れすとらん","りょうり"},
        new List<string>(){"げーむき","えきしょうげーむき","おもちや","こがたげーむき","にんてんどうすいっち","でんしげーむ","とい","ほびい","もばいるきき"},
        new List<string>(){"ごはん","あきたこまち","うるちまい","おこめ","ぎんしゃり","ささにしき","しゅしょく","たんすいかぶつ","ちゃわん","どんぶりめし","はくまい","ひとめぼれ","ふーど","むせんまい","めし","もちごめ","らいす","わしょく"},
        new List<string>(){"ぎたあ","うくれれ","えれきぎたあ","おんがく","がっき","げんがっき","さいどぎたあ","すとらいときゃすたあ","そうおん","でんしがっき","ばんど","ひきがたり","ベーすぎたあ","みゅーじっく","らいぶ","りーどぎたあ","れすぼーる","ろっくぎたあ"},
        new List<string>(){"はな","おはな","ききゃう","くさばな","けんかしょくぶつ","ざっそう","しょくぶつ","すみれ","のばな","ひやしんす","ふらわあ","のぐさ","りんどう"},
        new List<string>(){"いえ","うち","おうち","かおく","きんじよ","けんちくぶつ","こていしさんぶつ","じゅうたくち","すまい","たてもの","ちゅうこぶっけん","にせたいじゅうたく","はうす","ふどうさん","べっそう","ほーむ","まいほーむ","みんか","もちいえ","やしき","わがや"},
        new List<string>(){"かいちゅうでんとう","あかり","えるいーでぃい","こうげん","しょうめい","すもーるらいと","でんとう","はんどらいと","びっくらいと","ふらっしゅらいと","らいと"},
        new List<string>(){"すし","あかみ","うみのさち","えどまえずし","おすし","かじき","きはだ","くろまぐろ","さびぬき","じか","たべもの","ちゅうとろ","つな","とろ","なまもの","にぎりずし","びんちょう","ふーど","ほんまぐろ","まぐろ","みなみまぐろ","めばちまぐろ","りょうり","わしょく"},
        new List<string>(){ "でんしや", "かいそくれっしや", "きせい","こうきょうこうつうきかん","さぶうぇい","じぇいあーる","ちかてつ", "つうきんでんしや", "でんしや", "とれいん","のりもの","ぷらぷられーる", "まんいんでんしや", "めとろ","やまのてせん","りょこう", "れっしや", "ろめんでんしや"},
        new List<string>(){"らじかせ","おーでぃお","かせっとでっき","きかい","くろものかでん","さうんど","じゅしんき","すてれお","てーぷれこーだあ","とらんじすたらじお","ぷれいや","みゅーじっく","れこーだあ","ろくおんき"},
        new List<string>(){"へりこぷた","おすぷれい","かいてんよくき","きゅうじょたい","こうくうき","しんぐるろーたーしき","ていさつき","どろーん","のりもの","ひこうぶったい","ほばりんぐ","ゆうらんひこう","らじこん","れすきゅーたい"},
        new List<string>(){"ひこうき","あな","えあぷれーん","かいがいりょこう","きせい","くうゆ","こうくうき","じぇっとき","すかいまーく","ぜんにっくう","たび","つああ","とこう","にほんくうこう","のりもの","はいじゃっく","ふらいと","ぼーいんぐき","みんかんき","ゆそうき","りょかくき"},
        new List<string>(){"はっぱ","あおば","おちば","きのは","くさ","このは","ざっそう","しょくぶつ","なっぱ","みんと","やくそう","ようりょくそ","りーふ","わかば"},
        new List<string>(){"はち","あしながばち","いんせくと","おおすずめばち","がいちゅう","きらーびい","くまばち","こんちゅう","さつじんはち","じょうおうばち","すずめばち","せいぶつ","びい","ほーねっと","みつばち","むし","わすぷ"},
        new List<string>(){"ほん","あるばむ", "えいわじしよ", "かんわじてん", "きょうかしよ", "こうじえん","じしよ","すけじゅーるちょう","せんもんしよ","たんこうぼん","ちょうぼ","てがみ","どくしよ","にっきちょう","のーと","ばいんだあ","ひゃっかじてん","ぶっく","まんが","ようしよ","らいとのべる","ろっぽうぜんしよ","えいわじてん"},
        new List<string>(){"いか","あたりめ","うみのさち","かとるふぃっしゆ","ぎょかいるい","くらーけん","げそ","こういか","しろいか","するめ","だいおういか","つまみ","なんたいどうぶつ","ひもの","ほしいか","やりいか"},
        new List<string>(){"りぼん","あくせさり","おしゃれ","かみかざり","ぎふと","そうしょくひん","ちょうちょむすび","ぷれぜんと","ほうそう","むすびめ","らっぴんぐ"},
        new List<string>(){"たけ","あおだけ","かぐやひめ","くさ","ささ","しょくぶつ","そうほん","ちくりん","ばんぶう"},
        new List<string>(){"つぼ","あくとくしょうほう","おぶじえ","かき","こっとう","すやき","しがらきやき","せともの","たこつぼ","とうき","ぽっと","みずがめ","やきもの","われもの"},
        new List<string>(){"くちべに","いろじかけ","おしゃれ","けしょうひん","こすめ","べに","ほうべに","みだしなみ","めいく","りっぷすてぃっく","るーじゆ"},
        new List<string>(){"おの","あっくす","いしおの","えもの","かり","きこり","げんしじだい","せっき","たておの","ておの","とまほーく","なた","はもの","ぶき","まさかり"},
        new List<string>(){"しま","あいらんど","うみ","おきなわ","かいすいよく","き","こじま","さばいばる","すなはま","そうなん","つりば","とろぴかる","なんごく","はまべ","ひょうりゅう","へきち","まんちょう","みなみのしま","むじんとう","やしのき","りとう","るけい"},
        new List<string>(){"じてんしや","くろすばいく","けいしゃりょう","さいくりんぐ","ちゃり","つーりんぐ","でんどうじてんしや","とらっくれーさあ","にりんしや","のりもの","ばいしくる","ぽたりんぐ","ぴすと","まうんてんばいく","ろーどれーさあ"},
        new List<string>(){"かぶとむし","いんせくと","おおかぶと","こんちゅう","さいかちむし","せいちゅう","なつやすみ","びーとる","へらくれす","むし"},
        new List<string>(){"きのこ","いんかしょくぶつ","しじつたい","すーぱーきのこ","たべもの","どくきのこ","べにてんぐたけ","ほうししょくぶつ","まっしゅるーむ","やまのさち"},
        new List<string>(){"くま","あにまる","いきもの","きぐるみ","けもの","こぐま","せいぶつ","つきのわぐま","てでぃべあ","どうぶつ","みくしょく","はいいろぐま","ひぐま","ぷーさん","べあ","ほにゅうるい","もうじゅう","やせいどうぶつ"},
        new List<string>(){"ねっくれす","あくせさり","いし","おしゃれ","ききんぞく","くびかざり","こうぎょく","さふぁいや","じゅえる","そうしょくひん","るーす","ちょーかあ","てんねんせき","ひかりもの","ぺんだんと","ほうせき","ろけっと","ぱらいばとるまりん","ぶるーがーねっと","たんざないと","べにとあいと",},
        new List<string>(){"たまご","うでたまご","えっぐ","おんせんたまご","かたゆでたまご","けいらん","なまたまご","はんじゅくたまご","ぼいるどえっぐ","むせいらん","ゆでたまご","らんかく"},
        new List<string>(){"つき","うしみつどき","えいせい","おつきみ","かんげつかい","くらやみ","げっこう","しんや","すーぱーむーん","ちゅうしゅうのめいげつ","てんたいかんそく","ないと","ふるむーん","まんげつ","むーん","めいげつ","やみ","よる","るな"},
        new List<string>(){"こんびに","おみせ","かいもの","けんちくぶつ","しょっぴんぐ","すーぱあ","たてもの","ちぇーんてん","てんぽ","ばいてん","ふらんちゃいず","みせ","ろーそん"},
        new List<string>(){"くるま","あめしや","うんてん","えこかあ","かあ","けいじどうしや","こくさんしや","じどうしや","すぽーつかあ","せだん","ちゅうこしや","でんきじどうしや","どらいぶ","のりもの","はいぶりっどかあ","ふつうじどうしや","まいかあ","みにかあ","よんりんしや","らじこん","れんたかあ"},
        new List<string>(){"はんばーがあ","ぐーてんばーがあ","さんどいっち","じゃんくふーど","たべもの","ちーずばーがあ","どむどむばーがあ","びっくまっく","ふぁすとふーど","まくどなるど","もすばーがあ","ようしょく","りょうり","ろってりあ"},
        new List<string>(){"めがね","あいうぇあ","いんてり","えんきんりょうようめがね","おしゃれ","がんきょう","きんがん","ぐらす","だてめがね","どつきめがね","まじめ","れんず","ろうがんきょう"},
        new List<string>(){"てれび","あいまっく","うすがたてれび","えきしょうてれび","からーてれび","きかい","くろものかでん","こんぴゅーた","しゅうへんきき","すくりーん","ちでじ","でぃすぷれい","ぱそこん","ふるすくりーん","もにたあ"},
        new List<string>(){"じょうぎ","さし","すけーる","せんびき","そくりょう","たけじょうぎ","ちょくせんじょうぎ","はかり","ひっきようぐ","ぶんぼうぐ","めじゃあ","ものさし","るーらあ"},
        new List<string>(){"ねこ","あにまる","いえねこ","かいねこ","きゃっと","くろねこ","けもの","こねこ","すてねこ","せいぶつ","たま","どうぶつ","にゃんこ","ねこ","のらねこ","ぺっと","ほにゅうるい","まねきねこ","みけやこうせい"},
        new List<string>(){"さいころ","いち","うんだめし","かけごと","ぎゃんぶる","さいころ","すごろく","だいす","ちんちろりん","とばく","はんちょうばくち","りっぽうたい","ろくめんだいす"},
        new List<string>(){"てるてるぼうず","あめとめ","うき","おまじない","がんかけ","ぎしき","くびつり","しばりくび","ちゅうづり","つゆ","ひでりこい","めいしん"},
        new List<string>(){"ちょうちよ","あげはちょう","いんせくと","が","きあげは","こんちゅう","せいぶつてふてふ","ばたふらい","ひょうほん","むし","もす"},
        new List<string>(){"へび","あおだいしょう","いきもの","うわばみ","えと","おろち","がらがらへび","くちなわ","こぶら","すねーく","せいぶつ","だいじや"},
        new List<string>(){"ねずみ","すたじおしまづ","しまちゅう","めがね","あにまる","いきもの","えと","くまねずみ","げっしるい","こまねずみ","じっけんだい","せいぶつ","どぶねずみ","のらねずみはつかねずみ","ほにゅうるい","まうす","みっきーまうす","やまねずみ","らっと"},
        new List<string>(){"ほうちょう","えもの","きょうき","くっきんぐ","ごうとう","さつじん","ちょうりきぐ","でばぼうちょう","どす","ないふ","はもの","ぶき","ぺてぃないふ","やさいほうちょう","りょうり"},
        new List<string>(){"にんじん","あかだいこん","おかず","かんぽうやく","きゃろっと","こんさい","しょくざい","たべもの","なまやさい","ねっこ","べじたぶる","やさい","りょくおうしょくやさい"},
        new List<string>(){"のりまき","えほうまき","おすし","かっぱまき","きんたろうあめ","しょくじ","すし","たべもの","てっかまき","にほんしょく","のりまき","ふとまき","ほそまき","まきすし","りょうり","わしょく"},
        new List<string>(){"おばけ","あくりょう","いきりょう","うらめしや","えくとぷらずむ","かいきげんしょう","きょうふ","ごーすと","しんれい","たましい","ちみもうりょう","つきもの","ねないこだれだ","ばけもの","ひとだま","ふゆうれい","ぼうれい","もののけ","やこうせい","ゆうれい","ようかい","れい"},
        new List<string>(){"おにぎり","うめおにぎり","こめ","さけおにぎり","しおおにぎり","たんすいかぶつ","つなまよおにぎり","にぎりめし","のりおにぎり","ふーど","べんとう","めんたいこおにぎり","やしょく","らいすぼーる","わしょく"},
        new List<string>(){"さかな","あおぶだい","いらぶちゃあ","うみのさち","おさかな","かつお","ぎょるい","くろまぐろ","こざかな","しんかいぎよ","すしねた","せいぶつ","たんすいぎよ","ちぎよ","つな","とと","ねったいぎよ","はまち","ふぃっしゆ","ほんまぐろ","まぐろ","めだか","ようしょくぎよ"},
        new List<string>(){"といれっとぺーぱあ","おてあらい","かみ","きっちんぺーぱあ","さいせいし","しげん","ぺーぱあ","ほうたい","まきもの","らっぷ","ろーるし"},
        new List<string>(){"ゆうふぉお","あだむすきーがた","いせいじん","うちゅうせん","えんばん","かせいじん","ごうせいしゃしん","すぺーすしっぷ","そらとぶえんばん","ちきゅうがいせいめいたい","のりもの","ひこうぶったい","ぷらずま","みかくにんひこうぶったい"},
        new List<string>(){"かに","いきもの","うみのさち","えちぜんかに","ぎょかいるい","くらぶ","けがに","こうかくるい","さわがに","しおまねき","ずわいがに","せっそくどうぶつ","たらばがに","はさみ","べにずわいがに","まつばがに","やしがに","ゆでがに","わたりがに"},
        new List<string>(){"ふで","あーと","えふで","おえかき","げいじゅつ","こふで","すけっち","とりょう","はけ","びじゅつ","ふで","ぺいんと","めいく","もうひつ"},
        new List<string>(){"りんご","あっぷる","かじつ","きんだんのかじつ","くだもの","こうぎょく","じょなごーるど","せいか","たべもの","つがる","でりしゃす","ふるーつ","ほくと","み","むつ","やきりんご"},
        new List<string>(){"がっこう","ぎむきょういく","けんぞうぶつ","こうしや","しょうがっこう","すくーる","せんもんがっこう","そつぎょう","だいがく","ちゅうがく","つうがく","とうこう","にゅうがく","はいすくーる","びょういんぼこう","まなびや","やくしよ","よびこう"},
        new List<string>(){"おうかん","かんむり","えんぺらあ","おうさま","きんぐ","くらうん","けんりょくしや","こうぞく","じょおう","ぼうし","ろいやる"},
        new List<string>(){"たいよう","あさひ","えんてんか","おひさま","かいせい","こうせい","さん","しがいせん","せいてん","そーらあ","ちょくしゃにっこう","てんたい","なつ","にっこう","はれ","ひざし","ほし","まなつ","ゆうひ","ようこう"},
        new List<string>(){"がいこつ","あたま","いこつ","おばけ","ぎしき","くらにうむ","こっかくひょうほん","されこうべ","しゃれこうべ","ずがいこつ","そうなんしや","どくろ","なきがら","のざらし","はっこつしたい","ひとくい","へんしたい","ほね","まもの","むくろ","もののけ","ようかい"},
        new List<string>(){"なわ","あさなわ","おなわ","かうぼーい","きんばく","くびわ","けいりゅうろーぷ","こしなわ","ざいる","しちゅうひきまわし","すとりんぐ","つなひき","てなわ","とらっぷ","にづくり","ねっくれす","ばんじーじゃんぷ","ひも","りんぐ","ろーぷ","わな"},
        new List<string>(){"きりかぶ","かんきょうはかい","こしかけ","しぜんはかい","すたんぷ","つりい","ねんりん","ばっさい","めぶき","らんばつ","りんぎょう"},
        new List<string>(){"まいく","あいどる","いんたびゅう","うたってみた","おんがく","からおけ","くちぱく","ごっぱまいく","さうんどちぇっく","しかい","だいなみっくまいく","でもまいく","どくしょうかい","なまほうそう","にゅうりょくそうち","はんどまいく","ぼーかる","みゅーじっく","むせんまいく","らいぶ","りさいたる","れこーでぃんぐ","ろくおん","わいやれすまいく"},
        new List<string>(){"ぶた","あにまる","いきもの","おにく","かちく","こぶた","ざっしょく","しょくざい","せいぶつ","たべもの","ちゃーしゅう","どうぶつ","にく","のらぶた","ぴっぐ","ぽーく","みにぶた","やきぶた","ようとん"},
        new List<string>(){"しゃつ","あぱれる","いふく","うぇあ","かじゅある","きるもの","しゃつ","せんたくもの","てぃーしゃつ","なつふく","はんそで","ふく","へやぎ","めんずしゃつ","ようふく","らぐらんしゃつ","るーむうぇあ"},
        new List<string>(){"おかね","あたまきん","いんふれ","うらがね","えんのきれめ","かね","きゃっしゆ","けんきん","ごせんえんさつ","さつたば","しへい","せんえんさつ","そでのした","たいしょくきん","ちょきん","つみたてきん","てどり","とりひき","なつめそうせき","にせさつ","ねまわし","のぐちひでよ","ばいしゅう","ひぐちいちよう","ふくざわゆきち","へんきん","ぼーなす","まねえ","みのしろきん","むらさきしきぶ","やみきん","ゆうし","りょうがえ","ろうひ","わいろ"},
        new List<string>(){"にく","いちまいにく","おにく","ぎゃーとるず","げんしじだい","しょくりょう","たべもの","なまにく","ばーべきゅう","ふーど","ほねつきにく","まんがにく","みーと","やきにく","りょうり","れあ","ろーすとびーふ","わいるど"},
        new List<string>(){"かさ","あんぶれら","うてん","おりたたみかさ","こうもりかさ","さんしぇーど","つゆ","てんきよほう","なががさ","ぱらそる","ひがさ","ようがさ","れいん"},
        new List<string>(){"ろうそく","あろまきゃんどる","えすえむ","きゃんどる","こうげん","じょおうさま","たんじょうび","ともしび","ねつげん","ひあそび","ほうか"},
        new List<string>(){"くすり","いやくひん","えいようざい","おくすり","かぷせるじょう","きけんどらっぐ","げねつざい","こうがんざい","さぷり","じぇねりっくいやくひん","すいみんやく","せきどめ","ぞうきょうざい","だっぽうどらっぐ","ちけん","どらっぐ","ないふくやく","ねつさまし","のみぐすり","ばんのうやく","びょうき","ぷらせぼやく","ほすぴたる","まやく","めでぃしん","やくぶつ"},
        new List<string>(){"ぱん","あさごはん","しょくぱん","たんすいかぶつ","ちょうしょく","とーすと","ぶれっど","べーかりい","やまがたしょくぱん","ようしょく","らすく"},
        new List<string>(){"や","あろお","かり","きゅうどう","しゃげき","せきぞく","とびどうぐ","はまや","ぶき","ぼうがん","ゆみや"},
        new List<string>(){"ますく","ころな","さんみつ","いんふるえんざ","かぜ","そーしゃるでぃすたんす","きんきゅうじたいせんげん","あべのますく","じぞくかきゅうふきん"},
        new List<string>(){"ぼーる","うんどう","きゅうぎ","さっかーぼーる","じぇいりーぐ","すぽーつ","たまけり","ともだち","ふっとぼーる","わーるどかっぷ"},
        new List<string>(){"かばん","あたっしゅけーす","いれもの","けーす","さいどばっぐ","すくーるばっぐ","つうきんばっぐ","てさげかばん","とーとばっぐ","にもつ","ばっぐ","びじねすばっぐ","ぶらんどもの","ほんがわ"},
        new List<string>(){"かたつむり","いきもの","えすかるご","しゆうどうたい","すねーる","せいぶつ","でんでんむし","なめくじ","まいまい","むし","やまたにし","りくがい"},
    };

    public override void OnInspectorGUI()
    {
        TileListEntity database = target as TileListEntity;
        if (GUILayout.Button("Button"))
        {
            // 画像データを取得
            Sprite[] sprites = AssetDatabase.LoadAllAssetsAtPath("Assets/Image/images_size_32.png").OfType<Sprite>().ToArray();
            database.tileList.Clear();

            for (int i=0; i<sprites.Length; i++)
            {
                Panel panel = new Panel();
                panel.sprite = sprites[i];
                if (i < wordList.Count)
                {
                    panel.words = wordList[i];
                }
                else
                {
                    panel.words.Add("ななし");
                }
                database.tileList.Add(panel);
            }

        }
        base.OnInspectorGUI();
        EditorUtility.SetDirty(target);

    }
}